---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedWarn
source: html/c31f93f0-048f-5868-7336-2c0c0e8e0701.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchOverconstrainedWarn Property

Sketch is overconstrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchOverconstrainedWarn { get; }
```